import type { Translations } from "@/_locales/index";

export default {
  sidebar: {
    supporterMessage:
      "Παρακαλώ σκεφτείτε να γίνετε <0>Υποστηρικτής</0> για να διατηρήσετε το έργο ζωντανό!",
  },
  sponsorDialog: {
    title: "Το Complexity Χρειάζεται τη Βοήθειά σας!",
    description:
      "Αυτή η προσεγμένη και πλούσια σε χαρακτηριστικά επέκταση είναι το αποτέλεσμα αμέτρητων ωρών αφοσιωμένης ανάπτυξης και βελτίωσης. Αν εκτιμάτε την προσοχή στη λεπτομέρεια και τις συνεχείς βελτιώσεις, παρακαλώ σκεφτείτε να υποστηρίξετε την ανάπτυξη",
    descriptionLine2:
      "Αν το Complexity προσθέτει αξία στη ροή εργασίας σας, παρακαλώ σκεφτείτε να συνεισφέρετε στο μέλλον του!",
    donation: {
      title: "💖 Κάντε μια δωρεά",
    },
    sponsorship: {
      title: "🌟 Έχετε μια προσφορά για μακροχρόνια χορηγία;",
      contactEmail: "Επικοινωνία μέσω Email",
    },
  },
  misc: {
    words: "λέξεις",
    characters: "χαρακτήρες",
    rewrite: "Επανεγγραφή",
    speakAloud: "Εκφώνηση",
    stop: "Διακοπή",
  },
  releaseNotes: {
    title: "Ενημερώθηκε στην έκδοση v{version}",
    dontShowAgain:
      "Απόρριψη και να μην εμφανιστεί ξανά για μελλοντικές ενημερώσεις",
    confirmDialog: {
      title: "Επιβεβαίωση",
      message:
        "Είστε βέβαιοι ότι θέλετε να απορρίψετε και να μην εμφανίζετε ξανά για μελλοντικές ενημερώσεις; Μπορείτε πάντα να επανενεργοποιήσετε αυτό το αναδυόμενο παράθυρο στη σελίδα ρυθμίσεων.",
      cancel: "Ακύρωση",
      confirm: "Καταλαβαίνω",
    },
    dismiss: "Απόρριψη",
  },
} as const satisfies Translations;
